---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction
source: html/13b8ccf4-1b84-b1ec-6e4b-b0764d5ee5eb.htm
---
# MEPBuildingConstruction Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.